package com.v1.skuproject.domain.user;

public enum Major {
    자유전공학부1,
    자유전공학부2,

    // 미래융합학부 1
    경영계열,
    비즈니스영어전공,
    비즈니스일어전공,
    IT계열1,
    파이낸스앤테크전공,

    // 미래융합학부 2
    공공행정전공,
    경찰행정전공,
    아동청소년교육전공,
    IT계열2,
    환경화학공학전공,
    도시계획전공,
    토목건축전공,


    광고홍보콘텐츠학과,
    글로벌비즈니스어학부,
    공공인재학부,
    경영학부,
    군사학과,
    아동청소년학과,
    컴퓨터공학과,
    도시공학과,
    전자공학과,
    금융정보공학과,
    토목건축공학과,
    소프트웨어학과,
    물류시스템공학과,
    나노화학생명공학과,
    전자컴퓨터공학과,

    // 예술·디자인
    디자인학부,
    영화영상학과,
    광고홍보영상학과,

    // 음악·공연
    음악학부,
    실용음악학부,
    공연예술학부,
    무용예술학부,
    무용예술학과,

    // 뷰티
    헤어디자인학과,
    메이크업디자인학과,
    코스메틱뷰티매니지먼트학과,
    코스메틱뷰티테라피학과,
    뷰티테라피메이크업학과,

    // 테크
    아트앤테크놀로지학과,
    스포츠앤테크놀로지학과,

    // 융합전공
    사이버드론봇학융합전공,
    첨단인터렉티브공연융합전공,
    패션디지털트랜스포메이션융합전공,
    핀테크융합전공
}