package com.v1.skuproject.domain.user;

public enum Major {

    소프트웨어학과,

    // 인문사회과학대학
    아동청소년학과,

    // 글로벌비즈니스어학부
    영어전공,
    일어전공,
    중어전공,
    노어전공,
    불어전공,

    // 공공인재학부
    공공인재전공,
    경찰행정전공,

    // 경영학부
    글로벌경영전공,
    경영전공,

    // 이공대학
    금융정보공학과,
    전자컴퓨터공학과,
    나노화학생명공학과,
    물류시스템공학과,
    도시공학과,
    토목건축공학과,

    // 공연예술대학
    연기전공,
    연출전공,
    무대기술전공,
    모델연기전공,
    무대패션전공,
    뮤지컬전공,
    피아노전공,
    관현악전공,
    기악전공,
    작곡전공,
    보컬전공,
    싱어송라이터전공,
    한국무용전공,
    실용무용전공,

    // 디자인&영상대학
    영화영상학과,
    광고홍보영상학과,
    비주얼디자인전공,
    라이프스타일디자인전공,

    // 미용예술대학
    헤어디자인학과,
    메이크업디자인학과,
    코스메틱뷰티매니지먼트학과,

    // 미래융합대학
    컴퓨터소프트웨어전공,
    AI빅데이터전공,
    글로벌비즈니스전공,
    인텔리전트비즈니스전공,
    비즈니스영어전공,
    비즈니스일어전공,
    비즈니스중어전공,
    비즈니스불어전공,
    파이낸스앤테크전공,
    인텔리전트디바이스전공,
    인텔리전트컴퓨팅전공,
    공공행정전공,
    도시계획공학전공,
    아동청소년교육전공,
    토목건축전공,
    환경화학공학전공,
    자유전공학부,

    // 융합대학
    군사학과,
    아트앤테크놀로지학과,
    스포츠앤테크놀로지학과,
    융합전공
}