package com.v1.skuproject.domain.user;

public enum Major {
    광고홍보콘텐츠학과,
    글로벌비즈니스어학부,
    공공인재학부,
    경영학부,
    군사학과,
    아동청소년학과,


    컴퓨터공학과,
    도시공학과,
    전자공학과,
    금융정보공학과,
    토목건축공학과,
    소프트웨어학과,
    물류시스템공학과,
    나노화학생명공학과,
    전자컴퓨터공학과,

    사이버드론봇학전공,
    핀테크전공,
    패션디지털트랜스포메이션전공,
    첨단인터렉티브공연전공,
    아트앤테크놀로지학과,
    스포츠앤테크놀로지학과,

    아동학과,

    뷰티테라피메이크업학과,
    헤어디자인학과,
    메이크업디자인학과,
    코스메틱뷰티테라피학과,
    코스메틱뷰티매니지먼트학과,

    영화영상학과,
    광고홍보영상학과,

    실용예술학부,
    무용예술학부,
    음악학부,
    공연예술학부,
}